# St7CorrectAttachmentLinkGroups

Place attachment links in the same groups as the elements to which they attach, as required for a staged analysis.

long St7CorrectAttachmentLinkGroups(long uID)
Input Parameters
uID
Strand7 model file ID.

Dependencies
Selection
Links can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.